"""
    每日一考
"""

"""
现有列表 my_list = [10, 20, 30, 40, 50]，请编写代码实现：

向列表末尾添加一个元素 60。

取出列表中索引为 2 的元素。

计算列表中所有元素的和。
"""
my_list = [10, 20, 30, 40, 50]
my_list.append(60)
print(my_list[2])
print(sum(my_list))

"""
给定两个列表 list1 = [1, 2, 3] 和 list2 = [4, 5, 6]，
使用列表推导式生成一个包含所有可能的元素对的列表，
即 [(1, 4), (1, 5), (1, 6), (2, 4), (2, 5), (2, 6), (3, 4), (3, 5), (3, 6)]。
"""
list1 = [1, 2, 3]
list2 = [4, 5, 6]
list3 = [(x, y) for x in list1 for y in list2]
print(list3)

"""
使用for循环的嵌套，打印如下图形的*

    *
   ***
  *****
 *******
*********
"""
#
for i in range(1, 10, 2):
    print(" " * ((9 - i) // 2) + "*" * i)

#
for i in range(0, 5):
    x_i = "*" * (2 * i + 1)
    print(f"{x_i:^9}")